{
  "catalog_items": [
    {
      "id": 1,
      "full_name": "Інтерстеллар",
      "short_name": "Interstellar",
      "author": "Крістофер Нолан",
      "description": "Група дослідників подорожує крізь кротову нору в пошуках нової планети для людства. Фільм поєднує науку з емоційною драмою. Вражаюча візуальна складова та глибокі теми про час і любов.",
      "price": 8.7
    },
    {
      "id": 2,
      "full_name": "Дюна",
      "short_name": "Dune",
      "author": "Дені Вільньов",
      "description": "На пустельній планеті Арракіс вирішується доля галактики. Молодий Пол Атрейдес повинен прийняти своє призначення. Епічна науково-фантастична сага з глибоким світом і сильними персонажами.",
      "price": 8.0
    },
    {
      "id": 3,
      "full_name": "Матриця",
      "short_name": "TheMatrix",
      "author": "Лана і Ліллі Вачовські",
      "description": "Хакер Нео відкриває істину про світ, у якому живе. Цей культовий фільм поєднує екшн, філософію і кіберпанк. Матриця змінила вигляд сучасної наукової фантастики.",
      "price": 8.7
    },
    {
      "id": 4,
      "full_name": "Початок",
      "short_name": "Inception",
      "author": "Крістофер Нолан",
      "description": "Злодій, що проникає в сни, отримує складне завдання — не вкрасти, а посіяти ідею. Складна структура сюжету і візуальні ефекти зробили фільм класикою жанру. Його фінал досі викликає дискусії.",
      "price": 8.8
    },
    {
      "id": 5,
      "full_name": "Прибуття",
      "short_name": "Arrival",
      "author": "Дені Вільньов",
      "description": "Після прибуття інопланетян лінгвістка намагається розшифрувати їхню мову. Це інтелектуальна фантастика про комунікацію, час і вибір. Фільм вирізняється повільним, але глибоким наративом.",
      "price": 7.9
    },
    {
      "id": 6,
      "full_name": "Гравітація",
      "short_name": "Gravity",
      "author": "Альфонсо Куарон",
      "description": "Двоє астронавтів опиняються у відкритому космосі після катастрофи. Візуально вражаючий фільм із потужною емоційною напругою. Історія про виживання, ізоляцію і надію.",
      "price": 7.7
    }
  ],
  "category": {
    "short_name": "sci_fi",
    "full_name": "Фантастика",
    "special_instructions": "..."
  }
}
